tap "aws/tap"
tap "cirruslabs/cli"
tap "cloudflare/cloudflare"
tap "cntrump/brew"
tap "daipeihust/tap" # im-select
tap "dbcli/tap"
tap "fastly/tap"
tap "hashicorp/tap"
tap "jakehilborn/jakehilborn" # displayplacer
tap "oven-sh/bun"
tap "waydabber/betterdisplay"
tap "yt-dlp/taps"

cask "ghostty"
cask "kitty"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
# cask "sublime-text"
cask "sublime-merge"
# cask "visual-studio-code"
# cask "visual-studio-code@insiders"
cask "zed@preview"
# cask "zed"
cask "cursor"
# cask "cursor-cli"
cask "warp"
cask "alfred"
cask "bleunlock"
cask "postgres-unofficial"
cask "cyberduck"
cask "elpass"
cask "hammerspoon"
# cask "iina"
cask "karabiner-elements"
# cask "lm-studio"
cask "orbstack"
cask "raycast"
cask "shottr"
cask "tailscale-app"
cask "telegram"
# cask "termius"
cask "git-credential-manager"

cask "font-anonymous-pro"
cask "font-maple-mono-normal-nf-cn"
cask "font-cascadia-code-nf"
cask "font-lxgw-wenkai"
cask "font-monaspace-nf"
cask "font-source-code-pro"
